In [27]:
import pandas as pd
import statistics as std
import warnings
warnings.filterwarnings("ignore")

In [32]:
df=pd.DataFrame({"Name":["Jane", "Michael", "Willian", "Rosy", "Hana", "Ferdie", "Graeme"],
   "Salary":[50000,54000,50000,189000,55000,40000,59000]})

In [33]:
df

      Name  Salary
0     Jane   50000
1  Michael   54000
2  Willian   50000
3     Rosy  189000
4     Hana   55000
5   Ferdie   40000
6   Graeme   59000

In [37]:
mean=df["Salary"].mean()
mean

71000.0

In [38]:
mode=df["Salary"].mode()
mode

0    50000
Name: Salary, dtype: int64

In [39]:
median=df["Salary"].median()
median

54000.0

In [40]:
variance=df["Salary"].var()
variance

2742666666.6666665

In [41]:
standard_deviation=df["Salary"].std()
standard_deviation

52370.47514264756